// 固定的大類選項
export const CATEGORY_OPTIONS = ['ESG項目', '資安項目', '品質系統'];

// 根據選中的大類提供系統選項
export const SYSTEM_OPTIONS_BY_CATEGORY = {
  'ESG項目': [
    'ISO 14064-1組織層級溫室氣體查證',
    'ISO 14064-2專案層級溫室氣體排放減量',
    'ISO 14067產品碳足跡',
    'ISO 14064-1+14067 雙主導查證員',
    'ISO 50001能源管理系統',
    'ISO 14068-1碳中和',
    'ISO 46001水資源效率管理系統',
    '永續報告書撰寫技巧暨GRI 2021 新版解析(GRI、SASB、TCFD)',
    'AA1000永續報告查證師',
    'ISO 32210與永續金融管理師',
    'iPAS 淨零碳規劃管理師',
    'CBAM企業內控管理人才培訓班',
    'GHG Protocol核心盤查與報告實務'
  ],
  '資安項目': [
    'ISO 27001資訊安全管理系統',
    'ISO 27701隱私資訊管理系統',
    'ISO 27017/27018雲端服務安全管理',
    'ISO 42001人工智慧管理系統'
  ],
  '品質系統': [
    'ISO 9001品質管理系統',
    'ISO 14001環境管理系統',
    'ISO 45001職業安全衛生管理系統',
    'ISO 22000食品安全管理系統',
    'ISO 13485醫療器材品質管理系統',
    'ISO 22716化妝品優良製造規範',
    'ISO 19011管理系統稽核指引',
    'ISO 16949汽車品質管理系統',
  ]
};
